IdeaRS.OpenModel.Material.MatPrestressSteelEc2
Material prestressing steel Ec2

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.#ctor
Constructor

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Fm
Char. value of max. force (prEN 10138)

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Fp01
Char. 0.1% proof force

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Agt
Total elongation at max. force (prEN 10138)

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Fr
Fatigue stress range (prEN 10138)

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Fpk
Characteristic tensile strength (EN 1992-1-1)

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Fp01k
0,1% proof-stress (EN 1992-1-1)

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Epsuk
Characteristic strain at maximum load (EN 1992-1-1)

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Type
Type of prestress steel

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.SurfaceCharacteristic
Surface characteristic

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.Production
Production type

IdeaRS.OpenModel.Material.MatPrestressSteelEc2.DiagramType
Type of diagram